{
	"header": "GAT",
	"title": {
		"contactMe": "Contáctame",
		"aboutMe": "Sobre mi",
		"myTechstack": "Mi techstack",
		"projects": "Proyectos",
		"experience": "Experiencia"
	},
	"description": {
		"contactMe": "¿Parece que encajaría en tu equipo? ¿Tienes algún proyecto en mente? ¡Contacta conmigo desde aquí mismo!",
		"aboutMe": "¡Hola! Soy Gonzalo, un desarrollador Fullstack con 3 años de experiencia transformando ideas en software tangible.",
		"myTechstack": "Echa un vistazo a las tecnologías con las que trabajo",
		"projects": "Algunos de los proyectos en los que he trabajado",
		"experience": "Mi experiencia laboral y educativa"
	},
	"content": {
		"aboutMe": "¡Hola! Soy Gonzalo<br/><br/>Soy un <b>desarrollador Fullstack con 3 años de experiencia</b> transformando ideas en software tangible.<br/><br/>He trabajado en proyectos de empresas como <b>Wabi</b> (del Banco Santander), donde me encargué de desarrollos de aplicaciones web y móviles, incluyendo el frontend y el backend.<br/><br/>Soy mayormente autodidacta, con un gran dominio de lenguajes como <b>Java, Javascript, Go y Dart.</b><br/><br/>Me apasiona resolver problemas, y estoy familiarizado con metodologías ágiles de desarrollo.<br/><br/>Estoy constantemente actualizando mis conocimientos y habilidades ya que siempre tengo algún proyecto personal entre manos que supera lo que se en el momento.<br/><br/>¿Parece que encajaría en tu equipo? ¿Tienes algún proyecto en mente?<b>¡No dudes en contactarme!</b><br/><br/>Si todavía necesitas convencerte desliza hacia la derecha o haz click en la flecha para echar un vistazo a mis proyectos",
		"contactMe": "<p>Por si acaso alguien te ha enviado este enlace y no has visto mi trabajo me presentaré, ¡pero por favor échale un vistazo a mis proyectos!</p><p>¡Hola! Soy Gonzalo</p><p>Soy un <b>Desarrollador Fullstack</b> con 3 años de experiencia profesional transformando ideas en software tangible.</p><p>Si estás buscando a alguien para colaborar en un proyecto, discutir retos tecnológicos interesantes, o incluso una lluvia de ideas, ¡no dudes en ponerte en contacto conmigo! Estoy especialmente interesado en el desarrollo de backend, arquitectura de sistemas, y cualquier cosa que me empuja a pensar fuera de la caja.</p><p>Puedes ponerte en contacto conmigo por correo electrónico en <a href='mailto:gonagutor@gmail.com'>gonagutor@gmail.com</a> o usando de esta página. También puedes encontrarme en <a href='https://github.com/gonagutor' target='_blank'>GitHub</a> para ver más de mi trabajo. Conecta conmigo en <a href='https://www.linkedin.com/in/gonagutor/' target='_blank'>LinkedIn</a>. ¡Vamos a construir algo impresionante juntos!</p>",
		"contactForm": {
			"name": "Nombre",
			"surname": "Apellidos",
			"email": "Correo electrónico",
			"message": "Mensaje",
			"submit": "Contacta conmigo",
			"sent": "<b>Mensaje enviado</b><br/> Gracias por contactar conmigo, te responderé lo antes posible.",
			"errors": {
				"nameRequired": "El nombre es obligatorio",
				"emailRequired": "El correo electrónico es obligatorio",
				"messageRequired": "El mensaje es obligatorio",
				"emailInvalid": "El correo electrónico no es válido"
			}
		},
		"now": "Actualidad",
		"logoNotAvailable": "Logo no disponible"
	},
	"footer": {
		"projects": "Algunos de estos proyectos los tengo públicos en mi <a href='https://github.com/gonagutor/' target='_blank'>GitHub</a>, algunos no, pero si te interesa alguno no dudes en contactarme. Tampoco es esta la vista completa de mis proyectos, mi carpeta de proyectos tiene 68 carpetas, cada proyecto con tecnologías diferentes"
	},
	"alt": {
		"enableDarkMode": "Activar modo oscuro",
		"disableDarkMode": "Desactivar modo oscuro",
		"myPicture": "Foto de mi"
	}
}
